{
    "navbar": {
        "about": "about",
        "experience": "experience",
        "projects": "projects"
    },

    "home": {
        "greeting": "Hi",
        "name": "I am",
        "whatIdo": "I transform lines of code into pixels of personality, because even websites need a little flair",
        "about": {
            "title": {
                "normal": "Get to ",
                "highlight": "know me"
            },
            "text": {
                "partOne": "I'm a passionate",
                "webDev": "web developer",
                "and": "and",
                "designer": "UX/UI designer",
                "partTwo": "from Romania (currently living in Spain), with a focus on creating modern and sleek user experiences. My goal is to bring ideas to life through code, ensuring a seamless and engaging online presence. With a keen eye for design and a love for clean code, I strive to deliver web solutions that not only meet but exceed expectations."
            },
            "button": "Read more"
        },
        "skillsTitle": {
            "normal": "Some of my ",
            "highlight": "skills"
        },
        "projects": {
            "title": {
                "normal": "Some of my ",
                "highlight": "projects"
            },
            "button": "Check out more"
        },
        "offers": {
            "title": {
                "normal": "What I ",
                "highlight": "offer"
            },
            "front": {
                "title": "Frontend Development",
                "text": "Crafting seamless user experiences with responsive web solutions tailored to your needs, ensuring functionality meets design."
            },
            "ui": {
                "title": "UX/UI Design",
                "text": "Elevating user engagement through intuitive interfaces and captivating user experiences, blending aesthetics with usability for maximum impact."
            },
            "graphic": {
                "title": "Graphic design",
                "text": "From logos to marketing materials, unleash visually stunning designs that communicate your brand's essence and captivate your audience."
            }
        },
        "contact":{
            "social": "Social media",
            "nav": "Navigate"
        },
        "copyright": "All rights reserved"
    },
    
    "about": {
        "myself": {
            "title": {
                "normal": "About ",
                "highlight": "myself"
            },
            "text": "Hey there! 👋 I'm a super enthusiastic web wizard and design dazzler originally from Romania, but currently soaking up the sun in Spain! 🌞 My jam? Crafting super sleek and modern user experiences that'll knock your socks off! 💻✨ I'm all about bringing ideas to life through my trusty code keyboard, making sure your online presence is as smooth as butter. With my knack for killer designs and an obsession with squeaky-clean code, I'm on a mission to whip up web solutions that not only meet but totally blow your mind! 🚀🎨💥"
        },
        "skills": {
            "title": {
                "normal": "Technical ",
                "highlight": "skills"
            },
            "textOne": "Since 2019, I've been rocking the web developer scene, polishing up my skills in both frontend and backend wizardry. But wait, there's more! For a hot minute now, I've been diving into the freelance world, wearing multiple hats as a graphic guru, UX/UI extraordinaire, and frontend ninja.",
            "textTwo": "Now, let me spill the beans—frontend development has always been my groove. Why, you ask? Because it's where art and code collide in the most magical way! It's like bringing a canvas to life with a sprinkle of coding magic, and let me tell you, it's my happy place!"
        },
        "quips": {
            "title": {
                "normal": "Quirky ",
                "highlight": "Quips"
            },
            "text": "Aaaaand, for my personal side, I'm a nature nut, absolutely hooked on camping and hiking! 🏕️ But hey, I've got a cozy side too—I'm a total couch potato and cinephile, always down for a binge-watching session of series and movies. 🎬 And let's not forget my love affair with pizza... yup, you guessed it, I'm all about that cheesy goodness! 🍕"
        }
    },

    "experience": {
        "rindus": {
            "title": "front-end developer",
            "description": "In my capacity as a front-end developer, I played an integral role in a dynamic team focused on developing innovative solutions. Notably, I contributed significantly to an internal tool for a leading German advertisement space selling agency, leveraging the latest versions of Angular. Our tool, vital for agents, employed Google Maps for visualizing advertisement spaces and streamlining information gathering, cost assessments, and sales processes to clients. My responsibilities extended beyond frontend development; I also took a lead role in enhancing the checkout method, optimizing the user experience and ensuring seamless transactions for our clients. This multifaceted role allowed me to showcase adaptability, technical proficiency, and a commitment to delivering impactful solutions."
        },
        "conti_one": {
            "title": "full-stack developer",
            "description": "In my role as a full-stack developer, I spearheaded the development of four internal tools, showcasing expertise in both frontend and backend technologies. On the frontend, I exclusively worked with Angular (versions 8 to 11), while the backend was implemented using Spring Boot 2, .NET Core, and .NET Framework. I played a central role in designing each application, creating logos, and developing related illustrations. Leading one of the projects, I took charge of gathering stakeholder requirements, creating tasks, and efficiently distributing responsibilities among team members, fostering collaboration and ensuring successful project delivery."
        },
        "conti_two": {
            "title": "software developer",
            "description": "As a software developer, I played a pivotal role in crafting an internal testing tool for embedded code on microprocessors used in car components. The Eclipse plugin, primarily built with Java and complemented by C++ and C#, facilitated Unit tests, functional tool tests, and hardware tests, predominantly leveraging CANoe. My responsibilities extended to writing C tests for code evaluation and creating HTML pages for signal visualization. This experience honed my skills in software development, testing methodologies, and collaboration within a fast-paced environment."
        },
        "resume": {
            "static_text": "See full resume",
            "link": "here"
        }
    },

    "projects": {
        "mothers-birth-doula": {
            "text": "Mother's Birth Doula is a comprehensive website catering to soon-to-be mothers in New York, offering essential support and services. With a soothing palette dominated by light purple hues, the UI, crafted entirely by the designer, provides a serene and welcoming ambiance. The website, built using React and React Router, seamlessly integrates functionalities such as a contact form powered by EmailJS, ensuring efficient communication. Through thoughtful illustrations and intuitive design elements, Mother's Birth Doula establishes a comforting digital space, empowering expectant mothers in their journey towards childbirth.",
            "short": "A serene website designed with light purple hues, offering support for soon-to-be mothers in New York. Built with React and EmailJS integration."
        },
        "drk-clothing": {
            "text": "DRK Clothing epitomizes a portfolio project showcasing my adeptness in crafting an e-commerce platform using cutting-edge technologies. Built with React and Redux for seamless state management, the website boasts robust functionalities such as Google login and account creation with email and password. Leveraging Firebase for authentication and data storage, and Stripe for secure card payments, DRK Clothing stands as a testament to my mastery over a plethora of technologies. Despite grappling with a steep learning curve, the project serves as a testament to my dedication and adaptability, overcoming challenges to deliver a polished and feature-rich e-commerce experience.",
            "short": "A showcase e-commerce project demonstrating expertise in React, Redux, Firebase, and Stripe integration for seamless shopping experiences and secure transactions."
        },
        "gatsby-blog": {
            "text": "The Gatsby Blog serves as a testament to my journey in mastering Gatsby.js, showcasing newfound expertise in building lightning-fast and highly customizable websites. As a portfolio project, it highlights the developer's dedication to continuous learning and improvement in web development.",
            "short": "A portfolio project demonstrating proficiency in Gatsby.js, showcasing a minimalist and efficient online blog."
        },
        "aleb": {
            "text": "My old portfolio represents a revitalization of my online presence, transitioning from an outdated iteration to a sleek and modern showcase of skills and projects. Crafted with Vanilla JS and pure CSS, the website embodies my proficiency in front-end technologies. The UI, meticulously designed using Adobe Illustrator, reflects my keen eye for aesthetics and attention to detail, resulting in a visually captivating and user-friendly experience.",
            "short": "A revamped portfolio website showcasing skills and projects, designed and developed by myself using Vanilla JS, CSS, and Adobe Illustrator."
        },
        "suna-dubios": {
            "text": "Suna Dubios is an ingenious trivia board game that adds a twist to traditional gameplay, challenging players to deceive others with plausible lies. Created by the developer, this whimsical game features questions spanning science, history, and general knowledge, ensuring an entertaining and intellectually stimulating experience. With a captivating design crafted by the developer, Suna Dubios promises hours of laughter and friendly deception, offering a unique spin on classic trivia fun.",
            "short": "A witty trivia board game where players must bluff to conceal the correct answers, featuring whimsical questions across various topics."
        },
        "live": "Live website"
    },

    "contactForm": {
        "name": "Name",
        "message": "Message",
        "button": "Message me"
    }
}